fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОконачнияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных
&НаКлиенте
Перем СтароеЗначение;
&НаКлиенте
Процедура ВКМ_СпециалистОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтароеЗначение  = Объект.ВКМ_Специалист; 
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
 // СтандартныеПодсистемы.ПодключаемыеКоманды
  ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
 // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВКМ_ДатаПроведенияРаботПриИзменении(Элемент)
	СсылкаНаДокумент = СоздатьНовыйДокументПриИзмененииДаты() ;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = " Создано уведомление для телеграм-бота";
	Сообщение.Сообщить();

КонецПроцедуры



&НаКлиенте
Процедура ВКМ_СпециалистПриИзменении(Элемент)
	 НовоеЗначение = Объект.ВКМ_Специалист;
	Если СтароеЗначение <> НовоеЗначение Тогда
	
	    Документ = СоздатьНовыйДокументПриИзмененииСпециалиста();
    	Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = " Создано уведомление для телеграм-бота";
		Сообщение.Сообщить();
	Иначе
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = " Вы выбрали такого же специалиста";
		Сообщение.Сообщить(); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ВремяНачалаРаботПланПриИзменении(Элемент)
	    СсылкаНаДокумент = СоздатьНовыйДокументПриИзмененииВремяНачала();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = " Создано уведомление для телеграм-бота";
		Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ВремяОконачнияРаботПланПриИзменении(Элемент)
	СсылкаНаДокумент = СоздатьНовыйДокументПРиИзмененииВремяОкончания();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = " Создано уведомление для телеграм-бота";
		Сообщение.Сообщить();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ВыполненныеРаботы
&НаКлиенте
Процедура ВКМ_ВыполненныеРаботыВКМ_ФактическиПотраченоЧасовПриИзменении(Элемент)
// Начало кода расчет стоимость (ВКМ_диплом)  
  СтоимостьЧаса =  СтоимостьЧаса();
  ТекущиеДанные = Элементы.ВКМ_ВыполненныеРаботы.ТекущиеДанные;
  ПотраченныеЧасы = ТекущиеДанные.ВКМ_ФактическиПотраченоЧасов;
  
  ТекущиеДанные.ВКМ_ЧасыКОплатеКлиенту = СтоимостьЧаса *  ПотраченныеЧасы;  
  // Конец кода расчета стоимости (ВКМ_диплом)	
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
  Функция СтоимостьЧаса() 
  // Код для получения стоимости часа (ВКМ_диплом) 
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиентов.ВКМ_Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтоимостьЧаса = ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
	КонецЦикла;
	
    Возврат СтоимостьЧаса; 
	// Конец кода получения стоимости часа (ВКМ_диплом)  
КонецФункции 

&НаСервере
Функция СоздатьНовыйДокументПриИзмененииДаты()
   НовыйДокумент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
   НовыйДокумент.ТекстСообщения = "Дата проведения работ изменена на " + Объект.ВКМ_ДатаПроведенияРабот + " документа  " + Объект.Номер + " от " + 
   Объект.Дата;
   НовыйДокумент.Записать();
   Возврат НовыйДокумент.Ссылка;
КонецФункции

 &НаСервере
Функция  СоздатьНовыйДокументПриИзмененииСпециалиста() 
	
   НовыйДокумент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
   НовыйДокумент.ТекстСообщения = "Специалист был изменен " + Объект.ВКМ_Специалист + " документа  " + Объект.Номер + " от " + 
   Объект.Дата;
   НовыйДокумент.Записать();

   Возврат НовыйДокумент.Ссылка; 	
КонецФункции

&НаСервере
Функция  СоздатьНовыйДокументПриИзмененииВремяНачала() 

   ВремяНачалоРабот = Формат (Объект.ВКМ_ВремяНачалаРаботПлан,"ДЛФ=T");
   
   НовыйДокумент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
   НовыйДокумент.ТекстСообщения = "Время начала работ было изменено на  " + ВремяНачалоРабот + " документа  " + Объект.Номер + " от " + 
   Объект.Дата;
   НовыйДокумент.Записать();

   Возврат НовыйДокумент.Ссылка; 	
КонецФункции	

&НаСервере
Функция  СоздатьНовыйДокументПриИзмененииВремяОкончания() 

   ВремяОкончанияРабот = Формат(Объект.ВКМ_ВремяОконачнияРаботПлан, "ДЛФ=T");
   НовыйДокумент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
   НовыйДокумент.ТекстСообщения = "Время окончания работ было изменено на  " +  ВремяОкончанияРабот + " документа  " + Объект.Номер + " от " + 
   Объект.Дата;
   НовыйДокумент.Записать();

   Возврат НовыйДокумент.Ссылка; 	
КонецФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
